#pragma once

class GameEngineMath
{
public:
	static const float PI;
	static const float PI2;
	static const float HalfPI;
	static const float DegreeToRadian;	//60분법->호도법(0.017453...)
	static const float RadianToDegree;	//호도법->60분법(57.29577...)


private:
	GameEngineMath();
	~GameEngineMath();

	GameEngineMath(const GameEngineMath& _Other) = delete;
	GameEngineMath(GameEngineMath&& _Other) noexcept = delete;
	GameEngineMath& operator=(const GameEngineMath& _Other) = delete;
	GameEngineMath& operator=(GameEngineMath&& _Other) noexcept = delete;


public:
	static float Lerp(float _p1, float _p2, float _time)
	{
		return (1.0f - _time) * _p1 + _time * _p2;
	}

	static float LerpTime(float _p1, float _p2, float _time)
	{
		if (1.f <= _time)
		{
			_time = 1.f;
		}
		return Lerp(_p1, _p2, _time);
	}

};


class float4x4;
class float4
{
public:

	//자주 사용하는 숫자 조합을 미리 만들어놓으면 생성자 호출하는 연산비용을 아낄 수 있다.

	static const float4 Zero;	//0000
	static const float4 One;	//1111

	static const float4 Left;	//--x
	static const float4 Right;	//++x
	static const float4 Up;		//++y
	static const float4 Down;	//--y
	static const float4 Forward;//++z
	static const float4 Back;	//--z

	static const float4 Red;	//1001
	static const float4 Green;	//0101
	static const float4 Blue;	//0011
	static const float4 Yellow;	//1101
	static const float4 Magenta;//1011
	static const float4 Cyan;	//0111

	static const float4 Black;	//0001
	static const float4 White;	//1111

	//무명유니온의 장점??
	union
	{
		struct
		{
			float x;
			float y;
			float z;
			float w;
		};

		struct
		{
			float r;
			float g;
			float b;
			float a;
		};

		struct
		{
			float posX;
			float posY;
			float sizeX;
			float sizeY;
		};

		struct
		{
			int intValueX; 
			int intValueY;
			int intValueZ;
			int intValueW;
		};

		//동차좌표계(Homogeneous Coordinates): n차원의 공간을 n+1개의 좌표로 나타내는 좌표계라고 한다.
		//실질적으로는 투영변환, 그중에서도 원근투영변환의 결과값 == 카메라위치로부터의 방향이 적용된 값을 저장하기 위한 
		// 원소 w를 저장하기 위한 목적으로 사용한다.

		float arr1D[4];
		DirectX::XMFLOAT3 directXFloat3_;
		DirectX::XMFLOAT4 directXFloat4_;
		DirectX::XMVECTOR directXVector_;
	};


public:
	float4() : x(0.f), y(0.f), z(0.f), w(1.f)
	{
	}

	float4(float _value) : x(_value), y(_value), z(_value), w(1.f)
	{
	}

	float4(int _value) 
		: x(static_cast<float>(_value)),
		y(static_cast<float>(_value)),
		z(static_cast<float>(_value)),
		w(1.f)
	{
	}

